{"text": "<human>: Why is this joke funny? Q: What does a computer do when it is tired? A: It crashes!\nRosey: Did your computer ever stop working (freeze) or turn itself off when you wanted to use it? If it did, you can say your computer crashed. Computer crashes are frustrating because you cannot get your work done, and sometimes you lose the work you finished most recently, unless you saved it. Thankfully, they do not happen too often.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Where can you go to practice math on New Year’s Eve? A: Times Square!\nRosey: To get better at math, people often people often practice addition (+) or subtraction (-) problems; then they work on multiplication (x) and division (÷), and all the way through calculus and beyond. Practicing multiplication is also known as practicing your times tables. You can say what is seven times nine (7 x 9), or you can can say what is seven multiplied by nine. They mean the same thing, times or multiplied by.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: When does it rain money? A: When there is change in the weather!\nRosey: “The rain in Spain falls mainly on the plain,” according to the song from My Fair Lady. In Peru, they just wish it would rain! But nowhere does it rain money. Rain is water that falls from the sky as part of the evaporation/water cycle. When it is sunny outside, and then the weather changes to cloudy or rainy, we say that there is a change in the weather.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What happens when winter arrives? A: Autumn leaves! Why is this joke funny?\nRosey: In the northern hemisphere winter officially starts on December 21 (winter solstice, astronomical winter), but for many places in the north, it is already cold. Did you know that there is more than one way to mark the start of winter? Meteorologists, people who study the weather, talk about meteorological winter which starts on December 1. When talking about seasons, winter comes after fall; fall is also known as autumn.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Where do roses sleep? A: In a flower bed! Why is this joke funny?\nRosey: According to many surveys, roses are one of the most popular flowers. Although they have thorns, some people say that they are not that hard to grow.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the turkey cross the road? A: So people would think he was a chicken!\nRosey: In many countries throughout the world people celebrate a day of thanks. In the United States, Thanksgiving is celebrated on the 4th Thursday in November; that will be November 24 in 2022. One of the traditional foods for that celebration is turkey.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why was the Incredible Hulk so good at gardening? A: Because he had a green thumb!\nRosey: Dr. David/Robert Bruce Banner becomes the superhero known as the Hulk, or the Incredible Hulk, when he becomes angry. In that process of becoming the Hulk, his body transforms, becoming larger with lots of muscles, and his skin turns green. When his skin turns green, his whole body turns green, including his thumb.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What’s it like being kissed by a vampire? A: It’s a pain in the neck!\nRosey: Happy Halloween to those of you who celebrate! Many countries around the world celebrate Halloween, or another somewhat-related holiday around this time of year. A Mexican student of mine once commented that Halloween is a lot like Day of the Dead, but several others disagreed. I also disagreed, but can see some connections.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why was the jelly so stressed out? A: Because it was spread too thin!\nRosey: Jelly is a food made by boiling fruit juice with sugar until it becomes thick and sort of transparent. Jelly is similar to jam, marmalade, and preserves. This link can explain more about the differences between those different spreads.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why didn’t the girl trust the ocean? A: Because there was something fishy about it!\nRosey: While there are five named oceans, Arctic, Atlantic, Indian, Pacific and Southern, there is really only one world ocean. I would recommend having much respect for the ocean both because of its power to give life to the earth, and its dangerous power to take life through storms. As you already know the ocean has many fish in it. To trust someone means to have confidence that the person will treat you fairly, be kind, not hurt you.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: When is an apple grouchy? A: When it is a crab apple!\nRosey: In the north it is apple-picking season, and time for pumpkin spice everything!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the kids fire their squirt guns into the air on that windy day? A: They were just shooting the breeze!\nRosey: A squirt gun shoots a stream of water, much like a spray bottle, but in the form of a gun. Many people like to play by squirting water at their friends on a warm day outside. Some people train their pets by squirting water at them (others say that squirting animals does not work or is mean).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What lies on the bottom of the ocean and twitches? A: A nervous wreck! Why is this joke funny?\nRosey: To twitch means to make small, jerking movements. You may have experienced an eye twitch, or felt a leg twitch when you are falling asleep.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why are false teeth like stars? A: Because they come out at night! Why is this joke funny?\nRosey: False teeth has to come out at night so peope could clean them.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the farmer win the Nobel Prize? A: Because he was outstanding in his field! Explain this joke.\nRosey: I'll try my best. The Nobel Prize is awarded to people who “have conferred the greatest benefit to mankind.” That is, they have done something really, really important because it is something that is good for a lot of people. Outstanding means exceptionally good. People who win the Nobel Prize are outstanding in their field. In this case, field means the special area that they know a lot about such as literature, science, math, …", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why are elevator jokes the best? A: Because they work on so many levels! Explain this joke.\nRosey: I'll try my best. What goes up, must come down, says the old adage. (Blood, Sweat and Tears sang about that, too.) The same is true for elevators: Elevators (called a lift in England) go up and down to bring people to different floors in a building. The floors in a building are sometimes called levels. Just like in a video game where you move to the next level, elevators can take you up or down one or more levels.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What kind of candy can you get an an airport? A: Plane M&Ms! Why is this joke funny?\nRosey: Even though there are lots of studies that talk about sugar being bad for you, well, a little bit still tastes good. Every place in the world has candy, and candy can even make for a good joke too!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How is a good baseball game like good pancakes? A: They both need a good batter! Why is this joke funny?\nRosey: The baseball season in the United States and Canada is half done, so a baseball joke seemed appropriate. In baseball, the person who has the bat and is ready to hit the baseball is called the batter (in the sport of cricket, too). A good batter is able to hit the ball that is pitched, usually at 80 miles per hour or more. That’s fast, and hard to hit! And remember, if a player is able to get a hit 3 out of every 10 pitches, that is considered good.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the composer only compose while lying in bed? A: Because he was composing sheet music! Why is this joke funny?\nRosey: A composer is someone who writes music. Two of the most famous composers are Mozart and Beethoven.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What did the angry lumberjack say to the tree? A: I have an axe to grind with you!\nRosey: Lumberjacks are people who work cutting down trees so that people can use wood to make things. Many years ago, lumberjacks would use a saw and/or an axe to cut down trees. (Hopefully they planted two new trees for each one cut down!) Before working with an axe, it is important to sharpen the axe. One way to sharpen the axe is to use a grinder.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you call a fossil that never does any work? A: A lazy bones!\nRosey: Fossils are parts of a living thing that has been preserved, or left an impression from a very long time ago, perhaps 10,000 years ago or more. The human skull that was recently found in Minnesota was not called a fossil, maybe because it was only 8,000 years old. Bones are a very common type of fossil because they last longer than the soft parts of living things. Because fossils come from living things that have been dead for a very long time, they do not do any work.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What kind of flowers are great friends? A: Rose buds!\nRosey: Roses are one of the best known flowers. As a rose grows, in the spring you will notice buds. Rose buds are little bumps on the stem of a rose from which the flowers will appear. Yes, roses are beautiful! (Be careful of the thorns, though.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the two 4s decide to skip dinner? A: Because they already 8.\nRosey: Told to me by a 6th grader, this one made me laugh! It is rather absurd and it really makes no sense…so let me try to explain it.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What’s the best season for jumping on a trampoline? A: Spring time!\nRosey: The northern hemisphere is about a third of the way through the season of spring. Of course summer will come after spring, and then fall and winter. Spring is a beautiful time of year as the trees bud and bloom, the flowers are reborn, and the days get longer. (Actually, days do not really get longer than 24 hours, but the amount of sunlight during the day increases.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why are cats good at video games? A: Because they have nine lives!\nRosey: Many video games let you have another chance to keep going if you make a really bad mistake, maybe even getting your character killed. (Other games do not give you another life in the same game, and you have to start over.) I am reminded of the classic video game Pac-Man where you would get three lives. It also reminds me of the pre-video game era when people played pinball, and you had to score the maximum number of points with a limited number of balls.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Did you hear about the cross-eyed teacher? A: He couldn’t control his pupils!\nRosey: Someone whose eyes do not line up with each other, whose eyes do not look in the same direction, suffers from a medical condition called strabismus. In that situation, people cannot make their eyes look in the same direction. In non-medical terms, people whose eyes look in different directions may be called cross-eyed. The term cross-eyed can be used disrespectfully or can be used as a description. If you look down your nose, you are crossing your eyes. In your eyes, pupils are the center part of the eye, the black circle in the middle of the eyes that lets the light in.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What is the difference between a cat that got xeroxed and a cat that imitates its owner? A: One is a cat copy and the other is a copycat!\nRosey: Sometimes in English, brand names become verbs or nouns. For most people, all facial tissue is Kleenex, all internet searches are Googling, and all bandages are Band-Aids. (The term for this is anthimeria.) So, when you xerox something, you make a copy, a photocopy, because Xerox is a brand name of copiers.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the computer get new glasses? A: To improve his web sight!\nRosey: Every few years, it seems, I need to get new reading glasses that are just a bit stronger. The 20-20 vision of my youth has become more like the impressionist works of Monet. When people want to improver their vision, their eyesight, they often get new glasses.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How did the orange get into the crowded restaurant? A: He squeezed his way in! Why is this joke funny?\nRosey: As COVID cases wane, more and more people are heading out to restaurants. In the case of this joke, even the orange goes into a restaurant.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Can listening to the radio be an addiction? A: Depends on the frequency!\nRosey: Today is World Radio Day, so a radio joke seemed appropriate!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is the smartest animal? A: A snake, because no one can pull its leg! Why is this joke funny?\nRosey: There are a lot of smart animals! (My cat was not one of them, but I loved him anyway.) Snakes are not generally included in lists of the smartest animals. In this joke, though, they are the smartest.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why was the rope so stressed out? A: It was getting itself all tied up in knots!\nRosey: Last week an upset wire, this week a stressed out rope! Such is the pandemic life.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why was the metal wire so upset? A: It was getting bent out of shape over nothing! Explain this joke.\nRosey: I'll try my best. Metal wire comes in all sorts of sizes, measured by how thick it is. Electrical wire also comes in different thicknesses. Metal wire can be bent into many shapes so it is useful for art, for wiring a house, making motors, … When you bend a wire, you can make it into almost any shape", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What happened to the mouse when he fell into the bathtub? A: He came out squeaky clean!\nRosey: Just as a cow says “moo” and a pig says “oink,” mice squeak. If you are interested in hearing an hour of mice squeaking you can listen here (although I am not sure why you would want to).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the orange say to the banana when they were looking for the apple? A: Keep your eyes peeled! Explain this joke.\nRosey: I'll try my best. Whenever you eat a banana you have to peel it, that it, take off the yellow skin. There are many ways to peel a banana. To keep your eyes peeled means to keep your eyes open and watch carefully for something. I always keep my eyes peeled for new jokes that need explaining.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the past year seem to go by in a blur? A: Your resolution must have been too low! Explain this joke.\nRosey: I'll try my best. A new year’s resolution is a decision to do something (or stop doing something) so that your life will be better in the new year. Many people make a resolution to exercise more or read more; many people do not keep their new year’s resolutions.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why didn’t the aliens on the UFO land on Christmas morning? A: They were selfish, and did not want to share their presence!\nRosey: UFOs are unidentified flying objects, often seen as flying saucers. Flying saucers (if they exist) come from other galaxies and may have alien life on board. Wouldn’t it be fun to have proof of life from other parts of the universe! While there are many stories and pictures of UFOs, the existence of space aliens has never been proven… yet. They have never made their presence known to us.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is the nosiest game you can play? A: Racket-ball! Explain this joke.\nRosey: I'll try my best. Some people like some noise in their lives while others prefer a quiet environment. Some of us are in between–sometimes I like a little music or background noise but mostly I prefer quiet conversation.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the Christmas tree go to the barber? A: Because it needed to be trimmed!\nRosey: December is the season when many people prepare to celebrate Christmas. For those who celebrate, buying and decorating a Christmas tree is often very important. Decorating the tree is also called trimming the tree.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the ice cream cone become a news reporter? A: Because he wanted to get the scoop! Why is this joke funny?\nRosey: Do you watch the evening news? Listen to news on the radio or a podcast? Perhaps you read a newspaper? News reporters are always looking to provide their watchers, listeners, and readers with information about what is happening. Sometimes they are able to report on a big, important story, or one that no one has heard yet. That big, important story, unheard story is called a scoop. If a reporter gets the scoop, she or he gets an important story.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why don’t scientists trust the atoms they work with? A: Because they make up everything!\nRosey: Everything is made of atoms. Yes, those atoms, the ones that are found on the periodic table of the elements. It is still hard for me to believe that those little atoms make up the air we breathe, the trees that grow, the metal in my fork and knife. In this case, to make up something means that it is a part that makes up the whole of something.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why don’t mummies take vacations from their work? A: Because they are afraid to unwind!\nRosey: Most people enjoy taking a few days off from school or work to rest and relax, to unwind. In this sense, to unwind means to relax after work, after school, or after a stressful time.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why can’t you play hide and seek with mountains? A: Because they are always peaking!\nRosey: Hide and seek is a game that children play. In this game, one or more child finds a place to hide while another child closes his or her eyes and counts to 10. When the person counting gets to 10, that person goes to look for the ones who are hiding The person who is counting has to close his or her eyes in order not to see where the people are going to hide.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is the best way to talk to a giant? A: Use big words! Why is this joke funny?\nRosey: Giants are larger than life beings that can be good or evil, or a bit of both. Giants, though, are generally considered to be the antagonists in a story, the bad guys.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why did the thief wash his clothes after the robbery? A: He wanted to make a clean getaway!\nRosey: A thief is a robber, someone who steals things. Washing your clothes, well, you already know, will make your clothes clean. A robbery is the moment when something was stolen. If you want to get technical, the law in the United States differentiates between burglary, robbery, and theft, but people do not usually make that difference when they speak.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why didn’t the zombie go to work? A: Because he felt rotten!\nRosey: When you are sick, it is very important that you don’t go to work or school, especially now with COVID still making people sick. If you feel really sick you might say that you feel rotten; to feel rotten is an idiom meaning to feel sick.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why do birds fly south for the winter? A: Because it is too far to walk! Explain this joke.\nRosey: I'll try my best. Where I grew up, in Minnesota, it was very common to see birds fly south for the winter. When all of the lakes freeze, the trees lose their leaves, and ground is covered with snow, most birds cannot find food. It’s also just too cold for them to survive. So, they migrate to an area where they will be able to survive.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What time is it when your clock strikes 13? A: Time to get a new clock!\nRosey: When a clock “strikes the hour” it means that it is exactly on the hour, 8:00 or 11:00 for example (not 8:17 or 11:36) and the bells will chime. Here is Big Ben striking the hour.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the dentist and the manicurist decide not to be friends? A: Because they were always fighting tooth and nail! Why is this joke funny?\nRosey: A dentist is a doctor that improves the health of your teeth. A manicurist is a specialist who improves the health and appearance of your fingernails.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Is collecting shells on the beach easy to learn? A: Yes, you’ll pick it up right away!\nRosey: Picking up shells on a beach is easy because, if the beach has shells, you just bend over and lift them up with your hands.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why was the pirate sad when his parrot left? A: It gave him the cold shoulder! Explain this joke.\nRosey: I'll try my best. Yes, the last parrot joke for a while.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What is bright orange and sounds like a parrot? A: A carrot!\nRosey: Yes! A second parrot joke!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What creature is smarter than a talking parrot? A: A spelling bee! Why is this joke funny?\nRosey: And we’re back!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Where do ghosts like to go sailing? A: Lake Eerie!\nRosey: If you ever get the chance to go sailing, I would highly recommend it. It is a beautiful experience to let the wind move your boat without using a motor.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why didn’t the girl trust the trees near her home? A: They seemed a little shady!\nRosey: Shade is the darker, cooler area under a tree when the sun is shining on the tree. If you want to get out of the sun, you might stand under a tree in the shade. You might stand in the shady area.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why couldn’t the pony talk? A: He was a little horse!\nRosey: For most people, a pony is a small horse. There is actually a difference between a horse and a pony. In common conversation, though, most people do not make the distinction. A baby horse is called a foal, colt, or filly depending on age and gender.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why aren’t dogs good dancers? A: They have two left feet!\nRosey: Dogs have four feet called paws: two front feet and two back feet. You could also say that they have two right feet and two left feet. Sounds simple.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the baker go to the bank? A: He need some dough! Explain this joke.\nRosey: I'll try my best. There is nothing better than fresh baked bread! The smell is amazing and, if you can eat bread, the taste is divine.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Did you hear about the new corduroy pillow? A: No, but I bet they’re making headlines!\nRosey: I love my pillow! I have had it for, well, too long, and I should probably get a new one. Pillows are those soft cushions that you put under your head when you sleep. Pillows can also be found on sofas. Many people use pillows to support their back when they are sitting.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: How does a cucumber become a pickle? A: It goes through a jarring experience!\nRosey: Do you love pickles? I do!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you call a carrot that insults a rabbit? A: A fresh vegetable!\nRosey: It is springtime in the northern hemisphere and it is time to plant the vegetable garden. That way, you can eat fresh vegetables when they are ripe and ready to be picked. Fresh vegetables are vegetables that have been recently harvested, recently picked.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What does a dog do that a person steps into? A: Pants!\nRosey: Thank you to a friend from India for sending another joke about pants!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the golfer wear two pairs of pants? A: In case he got a hole in one! Why is this joke funny?\nRosey: I have never been golfing but this joke made me laugh.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the big flower say to the little flower? A: Hi, bud! Explain this joke.\nRosey: I'll try my best. Spring is in the air in the northern hemisphere and gardens are blooming!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did Humpty Dumpty have a great fall? A: He wanted to make up for a lousy summer!\nRosey: In my neck of the woods, summer has turned to fall.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the atoms cross the road? A: It was time to split! Explain this joke.\nRosey: I'll try my best. Atoms are the building blocks of matter, of all things. The element chart lists all the different types of atoms.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What is Irish and sits outside? A: Patio Furniture!\nRosey: March 17th is St. Patrick’s Day. Being of Irish heritage, I thought this joke appropriate… and it made me laugh.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why was Cinderella so lousy at baseball? A: Because she ran away from the ball and had a pumpkin for a coach!\nRosey: In the United States, baseball spring training has started in Florida and Arizona so how about a baseball joke?", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: While in their tank, what did one fish say to the other fish? A: Do you know how to drive this thing?!\nRosey: If you have a fish at home, it is in a tank: a fish tank (also called an aquarium). Normally when you hear about a tank and fish, you think of a fish tank. A fish tank is a glass box that holds water and fish.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the right eye say to the left eye? A: Hey buddy, just between you and me, something smells! Why is this joke funny?\nRosey: The phrase “something smells” usually means that something is giving off, emitting, a bad smell. In this joke, “something smells” refers to the nose and the action of smelling, of noticing that there is a odor or aroma that the nose can detect.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the scientist install a knocker on his front door? A: Because he wanted to win the no-bell prize!\nRosey: A knocker is that metal piece on the outside of a door that you use to make noise so that people know that you are there. An alternative to using a door knocker is to use a doorbell. A doorbell is a button, typically found next to the door, that you push to make noise inside the house so that people know that you are there.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What did the fish say when he swam into the concrete wall? A: Dam!\nRosey: As a language learner, it is important to know the swear words, the bad words, the words you probably shouldn’t say.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why can’t a woman ask her brother for help? A: Because he can’t be a brother and assist her too! Explain this joke.\nRosey: I'll try my best. Of course a woman can ask her brother for help! Just not in this joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you keep a bagel from getting away? A: Put lox on it! Explain this joke.\nRosey: I'll try my best. Bagels are a type of bread that look like a donut. They are round and have a hole in the middle, but they are not sweet. To eat a bagel, you usually cut it in half and put something on it like cream cheese.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call a bear with no ears? A: B! Explain this joke.\nRosey: I'll try my best. ", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What did the mouse say to the keyboard? A: You are really my type!\nRosey: Computer humor!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: If Mr. and Mrs. Bigger had a baby, who would be the biggest of all three of them? A: The baby because the baby is a little Bigger!\nRosey: Happy New Year! A baby joke for the new year seemed appropriate.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Where does satisfaction come from? A: A satisfactory! Why is this joke funny?\nRosey: Satisfaction is that feeling you get when things work out. I think of it as a feeling of calm joy because life is good, if only for a moment. There are other meanings of satisfaction, and the Rolling Stones sang about not getting any.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What do you call Santa’s helpers? A: Subordinate Clauses!\nRosey: Merry Christmas!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Where did the skunk sit when it went to church? A: In its own pew! Explain this joke.\nRosey: I'll try my best. Skunks are those small, squirrel-like animals that are colored mostly black with a white stripe down the back. Perhaps you remember that famous cartoon skunk, Pepe Le Pew? Skunks are known for protecting themselves by spraying a very bad smell.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Did you hear about the two antennas who got married? A: The wedding was awful but the reception was great! Explain this joke.\nRosey: I'll try my best. Antennas are used to receive and send electromagnetic waves so we can communicate (like with radios and TVs). Some antennas are a simple piece of wire while others are huge dishes.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: How do you get down from an elephant? A: You don’t get down from an elephant, you get down from a duck!\nRosey: Yes–another duck joke!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the turkey say to the hunter? A: Quack, quack! Explain this joke.\nRosey: I'll try my best. Happy Thanksgiving Day to readers who are celebrating Thanksgiving today. I hope you are safe, and healthy. Thank you for reading Explain the Joke!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What happened when the ship ran aground while transporting red paint and black paint? A: The crew was marooned! Explain this joke.\nRosey: I'll try my best. A bit of transportation humor this week. To run aground means that the ship was not floating, but the bottom of the ship was touching the ocean floor (the ground under the water). If a ship runs aground it is like a car hitting something and a big mess can occur. The ship in the joke was carrying red paint and black paint, so all all of the paint probably spilled and mixed together creating the color maroon.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you get a squirrel to like you? A: Act like a nut! Explain this joke.\nRosey: I'll try my best. In English, the word nut can refer to foods such as pistachios, cashews, and walnuts. Squirrels love to eat nuts, especially acorns if there are oak trees nearby.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why do skeletons stay so calm? A: Because nothing gets under their skin!\nRosey: Happy Halloween!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: How does the moon cut his hair? A: Eclipse it!\nRosey: A lunar eclipse happens during a full moon when the earth moves between the sun and the moon so that the full moon can no longer be seen. The moon, of course does not have hair but that is part of what makes this joke funny.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What do you get when you combine a porcupine and a turtle? A: A slowpoke!\nRosey: A porcupine is an animal that has needles which are called quills. The quills are sharp on the end and will hurt if they touch you, if they poke you (like when you get a shot in the arm).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What’s worse than finding a worm in your apple? A: Finding half a worm! Why is this joke funny?\nRosey: Imagine biting into an apple and finding a worm. Yes, that is a very unpleasant thought because your apple is most likely not in very good condition.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why was the baby strawberry crying? A: Because her parents were in a jam!\nRosey: Jam is a type of food that is typically made of fruit. Jam is usually spread on another food like bread or toast (like the way butter is spread on bread or toast). If you use strawberries to make jam, you have made strawberry jam. Mmmm! I like it.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What did the baby corn say to the mama corn? A: Where is pop corn?\nRosey: There are many types of families. Some families, like the one in this joke, are made of a mom, dad, and baby. Mom can be called mama; dad can be called pop.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What runs but never walks, murmurs, but never talks, has a bed but never sleeps, and has a mouth but never eats? A: A river! Why is this joke funny?\nRosey: Thanks the Instagram account of Glacier National Park for this week’s joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: When does a joke turn into a “dad” joke? A: When the answer is a parent! Why is this joke funny?\nRosey: There is a category of jokes called dad jokes. These are jokes that have really bad answers that will make you groan because they are stupid/silly. Puns fit nicely into this category. I rather like theses jokes. By the way, the answer to a joke is also called a punchline.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What is worse than raining cats and dogs? A: Hailing taxis!\nRosey: Precipitation is water in any form that falls from the sky. This includes rain, snow, sleet and hail. Hail is frozen rain, ice, that falls; it can be very small or quite large.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: How do you stop an astronaut’s baby from crying? A: You rocket!\nRosey: Astronauts are scientists who explore and study space. To get into space they blast off in a rocket. In this case, ‘rocket’ is a noun, a thing.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the Dalmatian say after eating lunch? A: Wow, that really hit the spot! Explain this joke.\nRosey: I'll try my best. If you have seen the movie 101 Dalmatians, you know that Dalmatians are a breed of dog known for their spots. While I like dogs, having 101 of them seems like a lot!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the child cross the playground? A: To get to the other slide! Explain this joke.\nRosey: I'll try my best. Back in 2013, the first joke that I explained was, perhaps, the most famous of all jokes–Why did the chicken cross the road? This joke is funny because it plays with that joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why do you always find something in the last place you look? A: Because when you find it, you stop looking!\nRosey: Perhaps this is more of a logic puzzle than a joke–but it is true! Often times we search long and hard for a missing thing and then find it in the last place we look. Is there a psychological reason it took us so long to find something? I do not know the answer to that. I do know that this joke makes me laugh.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What music frightens balloons? A: Pop music!\nRosey: When balloons explode, we say they pop. If you stick a pin in a balloon, it pops. If balloons had feelings, I am pretty sure that they would be scared of things that make the pop.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What race is never run? A: A swimming race!\nRosey: Thank you to a swimming friend who sent me this joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What do you call a mean cow? A: Moo-dy!\nRosey: Wow, there are a lot of jokes about cows!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What did one toilet say to the other toilet? A: You look flushed.\nRosey: After using a toilet, you need to move the lever that sends swirling water down into the sewer. Moving that lever is called flushing. To flush a toilet is to move the lever that starts the water moving.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why does the Statue of Liberty stand in New York Harbor? A: Because she can’t sit down! Explain this joke.\nRosey: I'll try my best. Happy 4th of July to readers in the United States! Wishing you a healthy and safe Independence Day.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do snails fight? A: They slug it out. Why is this joke funny?\nRosey: “Slug it out” is an expression that means to fight. Slug also means hit; if you slug someone, you hit someone. In baseball, a slugger is someone who good at hitting the ball.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Knock, knock. Who’s there?\nCargo.\nCargo, who?\nCar go, “Beep beep, vroom, vroom!”\nRosey: A knock knock joke to get you moving.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What stays in the corner but travels all around the world? A: A stamp! Explain this joke.\nRosey: I'll try my best. What fun it would be to travel around the world!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why do cats make terrible storytellers? A: They only have one tail! Why is this joke funny?\nRosey: A tale is a story. If you are a teller of tales you are a storyteller.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did one hat say to the other? A: You stay here. I’m going on ahead! Why is this joke funny?\nRosey: “To go on ahead” or “to go ahead” means to move forward to do something while leaving the other person behind.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you call a flower that runs on electricity? A: A power plant!\nRosey: A power plant is a place where electricity is made. There are many different types of power plants.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why would you want a chicken-proof umbrella? A: To use when the weather is fowl! Explain this joke.\nRosey: I'll try my best. Spring started back on March 19 in the northern hemisphere, while fall began for me here in the southern hemisphere. As the seasons change, I hope all of you are safe and healthy amid the coronavirus pandemic.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What is the difference between a well-dressed bicyclist and a poorly dressed unicyclist? A: Attire!\nRosey: Let’s start with some vocabulary:", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What kind of tree fits in your hand? A: A palm tree! Why is this joke funny?\nRosey: The palm of your hand is the part that faces things you grab. It is easier to see in the picture. The palm of your hand is rather small and, ordinarily, would not hold a tree.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What do you call a grilled cheese sandwich that gets right up in your face? A: Too close for comfort food!\nRosey: Comfort food is food that makes you feel good, perhaps by reminding you of a special time, place, or person. Comfort food is usually high in calories like macaroni and cheese, or lasagna.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What did the Daddy Scissors say to his children when they acted up? A: Cut it out!\nRosey: Of course, the scissors would say, “Cut it out!”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you make a Chinese egg roll? A: Just give it a little push! Why is this joke funny?\nRosey: Many families will be celebrating Easter this weekend, so an egg joke seemed appropriate.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Can you keep a sick, bald bird in your house? A: No, that’s ill-eagle!\nRosey: Many of us are staying home so that the world can flatten the coronavirus curve. With that in mind, I offer you an eagle joke and a live eagle cam so you can virtually leave the house.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you stay warm in any unheated room? A: Just sit in the corner where it is always 90º! Why is this joke funny?\nRosey: To understand this joke, you need to think about the temperature. 90º Fahrenheit is a hot temperature. Well, for me it is hot; maybe not for people living in places like Australia, India, the Middle East and Phoenix that experience hotter temperatures.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call a fake Irish stone? A: A shamrock! Explain this joke.\nRosey: I'll try my best. March 17th is St. Patrick’s Day, in honor of the patron saint of Ireland.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why did the banana put on sunscreen? A: He didn’t want to peel!\nRosey: The outside of a banana, the yellow part that you do not eat, is called the peel. (The outside of an lemon is called a rind and the outside of an apple is called the skin.) Peel is also the verb when you take off the outside of the banana, orange or apple: I peel the orange before I eat it.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you tell a hitchhiker on leap day? A: Hop in!\nRosey: Happy leap day, leap year day, February 29! It’s not every year I can explain a joke on February 29!! (Leap year happens once every four years.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the tiger say to her cubs before they went out to play? A: Be careful–it’s a jungle out there! Why is this joke funny?\nRosey: A jungle is a forest in tropical areas. In a jungle there are many trees and plants that no one takes care of because they grow on their own. There are many wild animals and birds in the jungle; there are lots of insects, too. A jungle can be a dangerous place for someone who is not familiar with it.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What did the ol’ pirate say on his birthday? A: Aye, matey!\nRosey: Happy birthday, matey, and have some cake! “Matey” means pal or friend.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you get when you cross a bear with a forest? A: Fur trees! Explain this joke.\nRosey: I'll try my best. Can you imagine a tree with fur growing on it? No, fur grows on animals, specifically, on mammals. Trees can’t grow fur, but bears can. All bears have fur covering their bodies.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What does an angel use to light a campfire? A: A match made in heaven!\nRosey: When people go camping, sometimes they will build a campfire for cooking, roasting marshmallows, or telling stories.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why shouldn’t you tell secrets on a farm? A: Because the potatoes have eyes and the corn has ears!\nRosey: Ah, yes- more food jokes!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What did one plate say to the other? A: Dinner is on me!\nRosey: When a meal such as breakfast, lunch, or dinner is served, it is typically put on a plate. If you go to a restaurant, the server may bring your food on a tray; the plates are then taken from the tray and set on your table. Your food is on the plate. So, if a plate full of food is talking, dinner (or lunch or breakfast) is really on the plate.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What does the gingerbread boy put on his bed? A: Cookie sheets!\nRosey: A gingerbread boy is a type of cookie that is made out of gingerbread and cut in the shape of a person. Many people in the United States bake gingerbread cookies during December and decorate them with frosting.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is a wizard’s favorite class in school? A: Spelling! Explain this joke.\nRosey: I'll try my best. To spell a word (verb) is to say each letter in the word one by one: l – e – t – t – e – r. (Spelling in English is a challenge!)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call a dog that can tell time? A: A watch-dog! Explain this joke.\nRosey: I'll try my best. A watchdog is a dog that guards your house; they are also known as guard dogs. (Watchdog can also refer to a group or agency that makes sure that other groups are doing good work.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What has many ears but cannot hear? A: A field of corn! Explain this joke.\nRosey: I'll try my best. “Ear” has two meanings (when used as a noun, a thing): 1) Most people (and most animals) have an ear on each side of their head that allow them to hear sound; 2) ear also means the whole cob of corn (see the picture).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What kind of shoes does a ninja wear? A: Sneakers!\nRosey: A very long time ago in Japan, ninjas worked as secret agents for the government; they were spies who were trained in the martial art of ninjutsu. They were known for being very quiet when they worked so that no one would hear them; ninjas sneak around quietly. To sneak (verb) means to go quietly so that no one will hear you.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Can a leopard hide anywhere he wants? A: No, he is always spotted! Why is this joke funny?\nRosey: If you have ever seen a leopard, you will know that leopards have spots. Spots are the round marks that a leopard has on its fur.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is the difference between a pirate and a cranberry farmer? A: A pirate buries his treasure while a cranberry farmer treasures his berries! Why is this joke funny?\nRosey: Cranberries are a sour fruit, related to blueberries, that are used to make cranberry sauce and cranberry juice. Because they are so sour they are not usually eaten by themselves.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why is a tree like a noisy dog? A: Because each has a lot of bark!\nRosey: Dogs bark; barking is the noise they frequently make (some dogs bark less then others). In this case, ‘bark’ is a verb, an action.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why do prisoners like the punctuation marks period (.), exclamation point (!) and question mark (?) when they write? A: Because each one marks the end of their sentence!\nRosey: If you have been convicted of a crime and sent to jail, your sentence is the time that you must stay in jail. Of course, everyone in jail awaits the end of their sentence so they can get out of jail.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What color is a happy cat? A: Purr-ple! Explain this joke.\nRosey: I'll try my best. Cats make two common sounds- they meow and they purr (they can also howl and screech but those sounds are not as common). Purring is that low, rumble that you can feel on a cat’s neck under its chin. Purring is a sound that a cat makes when it is happy.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the teacher wear sunglasses during class? A: Because her students were so bright! Explain this joke.\nRosey: I'll try my best. Have you ever seen a teacher wear sunglasses while teaching in a classroom? I haven’t. Most people only wear sunglasses when they are outside in the sun. The light from the sun is so bright that it is good for your eyes to shade them with sunglasses.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What can you catch but not throw? A: A cold! Explain this joke.\nRosey: I'll try my best. Are you familiar with the expression, to catch a cold? when you catch a cold you get a cold (runny nose, sneezing, maybe coughing, …) from someone else. Cold sometimes means the opposite of hot but in this joke it refers to getting sick.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why do bees have sticky hair? A: They use honey combs! Explain this joke.\nRosey: I'll try my best. You already know that bees make honey. Honeycomb is where honey is stored in the hive. The honeycomb is made of many hexagons (a 6 sided figure like a snowflake or nuts and bolts) that are made of wax.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call a cow with two legs? A: Lean meat! Why is this joke funny?\nRosey: For some reasons I find cows to be funny, like this joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Can a kangaroo jump higher than the Empire State Building? A: Of course! Buildings can’t jump! Why is this joke funny?\nRosey: Kangaroos are well known for being able to jump high and far with their powerful legs. Buildings, on the other hand, cannot jump.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the boy run around his bed? A: Because he was trying to catch up on his sleep! Explain this joke.\nRosey: I'll try my best. To catch up on something (such as sleep) is to do something you have not had time to do. You catch up on sleep by sleeping more after a time of little sleep. You can also catch up on the latest news by reading/ watching today’s news (or the newest tweets on Twitter, for example). Someone might say, “When I returned from vacation I had to catch up on the news/ my emails/ my homework …", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you keep an elephant from charging? A: Take away its credit cards! Why is this joke funny?\nRosey: When an elephant runs towards you or something else, we say the elephant is charging, much like a bull might charge (run) at the cape of a matador. To charge is also to pay for something by credit card. The beginning of the joke makes us think of how to stop an elephant from running at something- very difficult to do!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is the best time to go to the dentist? A: 2:30 (Tooth hurty!) Explain this joke.\nRosey: I'll try my best. A bad joke for the new year… and I hope your teeth (one tooth, two teeth) do not hurt!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you call a cow with no legs? A: Ground Beef!\nRosey: Beef is a type of meat that comes from cows, cattle. When this meat is put through a grinder it is called ground beef. Ground beef is the type of meat that is found in hamburgers and other dishes.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Frankenstein: Hey witch, can you make me a glass of lemonade? Witch: Poof! You’re a glass of lemonade! Explain this joke.\nRosey: I'll try my best. The word ‘poof‘ in this joke is the sound of a witch casting a spell. (I could have used the word zap or another magic word.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do ghosts read? A: Booooks! Why is this joke funny?\nRosey: Ghosts say, “Boo!” when they come out to scare you. Of course books are for reading. This joke is funny because it combines the word ‘boo’ with the word ‘books.’ Ok, it’s only sort of funny but it made me giggle.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call an American drawing? A: Yankee doodle! Why is this joke funny?\nRosey: There is a famous American song titled Yankee Doodle Dandy and a well known poem with a similar name. A doodle is a drawing, like you might make in your school notebook.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Where does the Easter Bunny go to eat pancakes? A: To IHOP, of course!\nRosey: IHOP is the shortened name for the International House of Pancakes. It is pronounced I-Hop. Hop: that is what rabbits do when they move; rabbits do not walk, they hop (or jump).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: How did the soggy Easter Bunny dry himself? A: With a hare dryer!\nRosey: The Easter Bunny is a character from folklore in the United States. He is said to bring eggs to children on Easter Sunday. Soggy means wet. So how would a wet rabbit dry itself? A hair dryer, perhaps. Or in this case, a hare dryer.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What is a pirate’s favorite letter? A: You might think it’d be R but ’tis the C they love!\nRosey: Pirates are known for saying “Arrrr.” But it is really the Sea (C) they love.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call a bear with no teeth? A: A gummy bear! Explain this joke.\nRosey: I'll try my best. The soft, red part that your teeth seem to come out of is called your gums. When you lose a tooth your gums will probably bleed a little but it is nothing to worry about.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What fruit do you eat when you are sad? A: Blueberries. Why is this joke funny?\nRosey: In English some colors are associated with feelings. Blue is associated with sadness. When you “feel blue” it means that you are feeling sad.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What musical instrument is found in the bathroom? A:A tuba toothpaste.\nRosey: A ‘tuba‘ is a large musical instrument, a brass instrument, that plays very low notes when you blow into it.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why are ghosts so bad at lying? A: Because you can see right through them!\nRosey: To “see through” someone means to understand them, what they really mean, to understand the truth. You can “see through” someone who is telling a lie; that is, you can tell that they are lying, not telling the truth.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why didn’t the skeleton want to go to school? A: His heart wasn’t in it. Why is this joke funny?\nRosey: A skeleton is just your bones; nothing on the inside and nothing on the outside. That means that there is no heart in a skeleton.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Another pun: I used to hate crayons but I’m drawn to them now. Why is this joke funny?\nRosey: Crayons are used for drawing. “To be drawn to something” means that something is enticing, attractive, makes you want to approach it or get to know it. I love water so when I see it, I am drawn to water. I am also drawn to chocolate and coffee. My students are drawn to the game Pokémon Go on their phones. This pun is funny because of the use of the word “drawn.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:What’s the best thing to put into a pie? A:Your teeth!\nRosey: Mmmmmm! I love a good pie! I love to sink my teeth into a good pie (“Sink your teeth into” is also an idiom)!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the Easter egg hide? A: Because he was a little chicken!\nRosey: An egg will soon become a chicken so you could say that an egg is a little chicken, a small chicken (OK, I know that an egg is not a chicken, not yet anyway, but that idea helps make this joke funny).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What is an astronaut’s favorite key on a keyboard? A: Space!\nRosey: Are you familiar with a computer keyboard? Here is a picture. The long key at the bottom is called the space bar or the space key. Of course it is the favorite of the astronaut because the astronaut goes to space!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why shouldn’t you tell an egg a joke? A: Because it might crack up!\nRosey: To crack up means to start laughing (sometimes it also means to to go crazy). When you break an egg you first crack it open.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why couldn’t the pirate play cards? A: Because he was sitting on the deck!\nRosey: The flat part of sail boat (or pirate ship!) where you stand is called the deck. A group of playing cards is called a deck of cards. If you are sitting on a deck of cards you can’t play with them… and that’s what the pirate was doing! Or maybe he was sitting on the deck of his ship.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:What kind of cookies make you rich? A:Fortune cookies!\nRosey: If you have a lot of money you have a fortune. The cookies that they give you in Chinese restaurants are called fortune cookies.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What bug do knights hate? A:Dragonflies! Explain this joke.\nRosey: I'll try my best. Bugs are insects. A knight (sounds like night) is a soldier for a king or queen. They often wore armor or a coat of mail and rode on horses. In stories, knights sometimes fight dragons.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What’s the difference between a teacher and a train?? A: A teacher says, “Spit out that gum!” and a train says, “Chew! Chew!” Why is this joke funny?\nRosey: Or perhaps the train says, “Choo, choo?!?”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why was there thunder and lightning in the lab? A: The scientists were brainstorming!\nRosey: I love a good thunderstorm! Especially if I am safe inside. A brainstorm is not a real storm but a way to gather ideas", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What tool can you use to cut water? A: A sea-saw! Why is this joke funny?\nRosey: To understand this joke you must first know what a seesaw is. A seesaw is a toy/ game/ ride that you might see on a playground where children play (it is also known as a teeter-totter). Imagine a long piece of wood that is balanced in the middle; one person sits on each end of the board and as one goes up, the other goes down.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Can February March? A: No, but April May!\nRosey: Happy Groundhog’s Day! Or Groundhog Day? Hmmm…", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: How does a snowman get around? A: He rides an icicle!\nRosey: Merry Christmas to those of you who celebrate!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call an elf who sings? A: A wrapper! Why is this joke funny?\nRosey: In this joke, elves are Santa Claus’ helpers. They are the ones who make the toys and wrap them so that Santa can deliver the toys on Christmas Eve. “To wrap a present” means to cover it with decorative paper to make the gift look nice. Wrapping a present also makes people wonder what is under the wrapping paper.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call a snowman with six-pack abs? A: The Abdominal Snowman! Explain this joke.\nRosey: I'll try my best. Let’s start with six-pack abs: six-pack abs are stomach muscles that are well formed and strong. To get six-pack abs you need to do a lot of exercise. (By the way, ‘abs’ is an abbreviation of abdominal muscles, stomach muscles.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the belt get arrested? A: Because it held up a pair of pants!\nRosey: To hold up: this phrase has more than one meaning. You could take a magic wand in your hands and hold it up in the air like Harry Potter; a piece of tape can hold a piece of paper to the wall; a belt can hold up a pair of pants. In these examples one thing holds another thing in place.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the can crusher quit his job? A: Because it was soda pressing! Explain this joke.\nRosey: I'll try my best. A can of pop, a can of Coke, a can of soda… all are pretty much the same thing. Before you recycle the can, though, you should crush it– crush the can, that means to use pressure to change the can from big to little as in the picture. There are machines that can crush a can (called a can crusher) and the person who crushes the can is also called a can crusher). If you press a can of soda (pop) I could say that you are “soda pressing.” It would be an unusual thing to say but I could say it.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: If April showers bring May flowers, what do May flowers bring? A: Pilgrims!\nRosey: Happy Thanksgiving!! This is one of my favorite jokes and one that I did not understand when I was a kid.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do lawyers wear to court? A: Lawsuits! Explain this joke.\nRosey: I'll try my best. There are many, many lawyer jokes; this is just one example.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What happens if you eat yeast and shoe polish? A: Every morning you will rise and shine!\nRosey: Yeast is the ingredient in bread that makes it rise; if there is no yeast or the yeast is dead you will get flat bread or flatbreads.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What do you call a fake noodle? A:An Impasta!\nRosey: Noodles, such as spaghetti noodles, can be called pasta.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What is it called when a cat wins a dog show? A: A CAT-HAS-TROPHY!\nRosey: Today in the United States is National Cat Day! so a cat joke seemed appropriate.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Did you hear about the hungry clock? A: It went back four seconds!\nRosey: To “go back for seconds” means to serve yourself more food from the kitchen, the serving dishes or perhaps the buffet line. And you only “go back for seconds” if you are hungry. The word ‘four’ (4) sounds the same as ‘for.’", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:What’s the difference between a guitar and a fish? A:You can’t tuna fish!\nRosey: Tuna fish? No, tune – a – fish. You see, for a guitar to sound good, you have to tune it. A fish cannot be tuned… but there is a fish called a tuna fish.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you make a fire with two sticks? A: Make sure one of them is a match! Explain this joke.\nRosey: I'll try my best. This joke only works if you know what a matchstick is. If you have a match or a matchstick you can easily make a fire. This joke leads one to think that the answer will be “rub two sticks together” but that would be too much work for a joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Why can’t fishermen be generous? A:Because their business makes them sell fish! Why is this joke funny?\nRosey: This is a bad pun (are there good puns?)! Their business makes them ‘sell fish’ or shall I say “selfish.” Yes, sell fish sounds just like selfish but there is a world of difference in the meaning. A selfish person is someone who wants everything for him or herself.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: How do you paint a rabbit purple? A: With purple hare spray!\nRosey: Hair≠ Hare but they sound the same. Hair is on your head and sometimes people use hairspray to keep their hair in place. Hare is an animal similar to a rabbit. And there is no such thing as Hare Spray! (But there is spray paint.)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why do bananas have to put on sunscreen before they go to the beach? A: Because they might peel!\nRosey: A banana peel is the outside skin of the banana. Your skin can peel if you are in the sun and you get a sun burn. In order to avoid a sunburn you need to use sunscreen.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What’s a llama’s favorite movie? A:Llamadeus!\nQ:What do you call a very fast llama?\nA:A Llamaghini! Why is this joke funny?\nRosey: Both of these jokes play with the word llama: the first changes Amadeus into Llamadeus; the second changes Lamborghini into Llamaghini. Many jokes in English play with words in this way.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What’s more amazing than a talking llama? A: A spelling bee!\nRosey: I love llamas– especially here in Peru. And no, llamas do not talk but it sure would be amazing if they did!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Why don’t you do arithmetic in the jungle? A:Because if you add 4 + 4 you get ate! Why is this joke funny?\nRosey: So, school starts tomorrow in St. Paul, MN so this bad joke is for my SPPS friends.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What has 4 wheels and flies? A:A garbage truck!\nRosey: When you hear “4 wheels and flies” you expect that the word “flies” means something that flies in the air like an airplane or perhaps Superman. You do not expect that “flies” means the insect, fly (or rather the plural of fly: flies).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What goes through towns, up hills and down hills but never moves? A: The road!\nRosey: A road goes through towns, a road goes up hills and a road goes down hills but a road never moves- the vehicles on the road move.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Why should you take a pencil to bed? A:To draw the curtains! Explain this joke.\nRosey: I'll try my best. At night, many people close the curtains (shut the curtains, draw the curtains) to keep the light out. “Draw the curtains” is another way to say, “Close the curtains” or shut the curtains.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What do prisoners use to call each other? A:Cell phones!\nRosey: A cell phone is a celular phone, a mobil phone. They are the ones that are replacing land lines as we stay connected 24/7. Did you know that there are more than 6 billion cell phones in use?", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is the tallest building in the world? A: A library- it has the most stories! Explain this joke.\nRosey: I'll try my best. The word story has more than one meaning: the floors of a building, a 5 story building for example, or an account of events that happened to real or imaginary people.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you get when you cross a cow and a duck? A: Milk and quackers! Explain this joke.\nRosey: I'll try my best. Bad joke, my apologies… but it made me giggle.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why are frogs so happy? A: They eat whatever bugs them! Why is this joke funny?\nRosey: Bugs– those bothersome little insects. If something “bugs you” that means that something irks you, bothers you, pesters you, annoys you, is bothersome to you, …", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What did one pencil say to the other pencil? A: You’re looking sharp!\nRosey: When the writing end of a pencil is pointed, we say that the pencil is sharp (the non-writing end is the eraser).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why did the picture end up in jail? A: It was framed!\nRosey: Pictures are often put into frames, the wood or metal box that goes around the picture with glass or plastic, to keep the picture safe.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:Why can’t you give Elsa a balloon? A:She will Let It Go!\nRosey: Did you see the movie Frozen? Elsa is the main character. Her big song is “Let It Go.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:What did the farmer say when his hay started blowing away? A:Hay, come back!\nRosey: Hay is grass that has been cut, dried, and stored for use as animal food, especially for cattle, horses, goats, and sheep.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:What’s the best place to shop for a soccer shirt? A:New Jersey!\nRosey: Quite simply, the shirt that soccer players wear is called a jersey. New Jersey is one of the 50 United States. If you want to buy a new shirt, you want to buy a new jersey. Where else? In New Jersey!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why do soccer players do so well in math? A: They know how to use their heads! Explain this joke.\nRosey: I'll try my best. To ”use your head” means to think. People who do well in math use their heads when they think and solve math problems.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:Where do sick boats go to get healthy? A:To the dock!\nRosey: A dock is a walk-way that extends from the land into the water. Boats can be tied to the dock so they do not float away.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why did the raisin go out with the prune? A: He couldn’t get a date!\nRosey: Raisins are dried grapes. Prunes are dried plums. Dates are just dates. All three are fruits.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What do Santa’s elves do after school? A:Their gnomework! Why is this joke funny?\nRosey: Gnome rhymes with home. After school most students do homework; elves do “gnomework.” This is funny because elves and gnomes are both magical creatures and because of the rhyme.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is the best Christmas present ever? A: A broken drum- you can’t beat it! Why is this joke funny?\nRosey: Merry Christmas and feliz navidad!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What is the best way to communicate with a fish? A: Drop it a line!\nRosey: When you go fishing you drop a line in the water to catch a fish. To “drop someone a line” means to send a short letter, send a note. I suppose now it could even mean to send someone a text message (I never did learn the difference between a text message and an SMS).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What do you call a pig that is no fun to be around? A: A boar!\nRosey: A boring pig, that is. There are several names for swine in English including pig, hog and boar. And then when we eat pig it can be called bacon, ham, pork chop, … Who knew the pig produced so much vocabulary?!?!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What did the dog say when he rubbed sandpaper on his tail? A:Rough, rough! Explain this joke.\nRosey: I'll try my best. Another wonderful, classic dog joke! Sandpaper is rough, it is used to make things smooth. In English, when a dog barks it says, “Ruff.” This joke is funny because it plays with two words that sound the same, ruff and rough.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:Where did the spaghetti and the sauce go to dance? A:The meatball!\nRosey: I love spaghetti! Grandma used to make the best spaghetti and meatballs. A meat ball is a ball of meat, often found on top of spaghetti. A “ball” can also be a dance (see the Cinderella joke). This joke plays with the word ball/meatball and is kind of, sort of funny. Thanks Daniel!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Where did the baseball keep its lemonade? A: In the pitcher! Explain this joke.\nRosey: I'll try my best. It is the end of summer, the end days of baseball and lemonade. School starts tomorrow (and as a teacher I love that!).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What lights up a soccer stadium? A: A soccer match! Why is this joke funny?\nRosey: I love soccer so, another soccer joke (I could have said football or fútbol).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Why are pigs so bad at soccer? A:They are always hogging the ball! Why is this joke funny?\nRosey: To “hog the ball” means to keep the ball to yourself and not pass the ball. A good soccer player looks to his or her teammates to see who has the best chance to advance the ball toward the goal; a good soccer player does not hog the ball.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the mother lion say to her cubs before dinner? A: Shall we prey! Why is this joke funny?\nRosey: Many people pray before dinner; they say words of thanks to their god, spirit or higher being. Prey (with an ‘e’ not an ‘a’) is the animal that is being hunted by another animal.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:How are fish and music the same? A:They both have scales!\nRosey: Fish scales are the outer part, the skin, of a fish. Musical scales are a series of notes that go up or down (there are many types of musical scales). This joke plays on the double meaning of the word “scale.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:Why do flamingos stand on one leg? A:If they lifted the other leg they would fall over!\nRosey: Not what you expected? Of course not! That’s why this joke is funny.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why was the tree excited about the future? A: It was ready to turn over a new leaf!\nRosey: “To turn over a new leaf” means to start anew, to start again, fresh. Someone who has had problems might turn over a new leaf and begin again (study more, learn something new, stop a bad habit, start a new good habit such as exercising, …).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why was the baseball player a bad sport? A: He stole third base and then went home! Why is this joke funny?\nRosey: To be a bad sport is to not play nicely or to not play fairly. In baseball when you “steal a base” you do to actually steal the base, you do not take something that does not belong to you without permission or without paying; when you “steal a base” you advance to the next base with out being stopped by the opposing team. In baseball when you “go home” you you do not go to the place where you live; when you “go home” you return to home plate where you started out, batting, and you score a run.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Who earns a living driving their customers away? A: A taxi driver!\nRosey: To “drive someone away” means to repel them, to force them to go away from you. This phrase is used to describe a battle (6th paragraph) in a war when it is said, for example, “The attacking army was driven away by the defending army.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What is the math teacher’s favorite dessert? A: Pi!\nRosey: “Dessert” (with 2 s) is a sweet treat after a meal; “desert” (with 1 s) is an area of the earth that gets little or no rain. An easy way to remember: people always want more dessert and it has more of the letter s. One type of dessert is pie; I especially like blueberry pie.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:How do you make an orange giggle? A:Tickle its navel!\nRosey: Oranges are a delicious fruit. One type of orange is the navel orange. Navel is also a word used for your belly button. If someone tickles your belly button, it might make you giggle.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What kind of candy is never on time? A: Chocolate! Why is this joke funny?\nRosey: Candy! That sweet treat, usually made with lots of sugar. Chocolate is one type of candy. The last part of the word “chocolate” is “late.” If you are late, you are not on time. This joke is funny because it plays with just a part of the word chocolate, the late part.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why was it so hot in the stadium after the baseball game? A: All the fans left!\nRosey: At a baseball game, the fans are the people who are watching the game. The fans leave the stadium when the game is over. Baseball games are played at a stadium. A fan is also a small (or large) machine that has a part that spins to move air. If there are no fans (that move air) at a stadium the stadium could get hot.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What did the paper say to the pencil? A: You’ve got a good point!\nRosey: Pencils are used for writing. When the lead (now it is made of graphite) is sharp it is pointy, it has a point.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What is the best food to eat when you are scared? A:I scream!\nRosey: People scream when they are scared, I mean, really scared. When was the last time you were really scared? Hopefully it was for something fun like a roller coaster and not for something terrible like a car accident or an earthquake.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What is the craziest way to travel? A:Loco-motive! Why is this joke funny?\nRosey: A sort-of bilingual joke! ¡Que bueno! The Spanish word “loco” means “crazy” in English. A locomotive is a train. Therefore, a loco-motive is a crazy-travel machine. But just in this joke- I actually like to travel by train.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why didn’t the string ever win a race? A: It always tied! Why is this joke funny?\nRosey: A string is many long pieces of thread together. Shoelaces are also a type of string. Of course you can tie a string in a knot. So, a string can be tied.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What did the math book say to the psychologist? A: “Would you like to hear my problems?”\nRosey: A math book has problems, many math problems. The purpose of a math book is to teach you how to think like a mathematician and to solve math problems.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:Why did the hamburger always lose the race? A:It could never ketchup!\nRosey: Ketchup is a thick liquid made from tomatoes; Ketchup is made from tomatoes. Many people put ketchup on their hamburgers. To “catch up” means to get to the same place as the person who is ahead of you.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why was the sewing machine so funny? A: It kept everyone in stitches!\nRosey: A sewing machine is used to make shirts, pants and anything made of fabric that needs to be sewn. When the sewing machine does its work, it makes stitches that hold two pieces of fabric together. To “keep someone in stitches” means to keep someone laughing.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why can’t the bank keep a secret? A: It has too many tellers!\nRosey: When you go to a bank, the person who helps you deposit (put in) or withdraw (take out) money is called a teller. When you share a secret, you tell a secret. The -er ending on some nouns make that noun into the person who does that thing:", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What did the bread say back to the peanut butter? A:I think you’re nuts!\nRosey: Peanut butter is made of peanuts, a type of nuts. To be nuts means to be crazy.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the peanut butter say to the bread? A: Quit loafing around! Explain this joke.\nRosey: I'll try my best. When you grind up peanuts, you get peanut butter. Bread that you buy at the grocery store, in the United States, mostly comes in a loaf; it is called a loaf of bread. Loafing around means to be lazy and not do anything.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:What is a plumber’s favorite food? A:A leek!\nRosey: A plumber is a person who fixes water pipes if they are clogged or are dripping; that is, if they have a leak.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Person 1: Did you hear about the new restaurant on the moon? Person 2: No, what can you tell me about it?\nPerson 1: It has great food but no atmosphere! Why is this joke funny?\nRosey: A restaurant is a place to eat. Usually in a restaurant someone asks you what you want to eat and then serves you your food; then you pay for the food. To some people the food is the most important (if not the only) part that matters. To other people, the atmosphere of the restaurant matters. The atmosphere of a restaurant is the way it looks, the way it sounds, the way it smells; it is the way you feel when you are there- much more than just the taste of the food.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the lady wear a helmet every time she ate? A: She was on a crash diet!\nRosey: A crash diet is a diet where a person loses a lot of weight in a short amount of time: lose weight fast. A helmet is protection for your head when you are playing a sport or working.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call a boomerang that doesn’t come back? A: A stick! Explain this joke.\nRosey: I'll try my best. That’s just silly! A boomerang is currently used as a toy but according to some histories it was/ is used for hunting. Originally it was made of wood but now can be made of plastic or other material.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: How did the karate teacher greet his students? A: “Hi-Yah!”\nRosey: To greet someone is to say, “hello” (or something similar) when you meet him or her. The words “Hi-Yay” are a common sound when doing karate. Saying “hi” is also a common way of greeting people.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:Why is spaghetti the smartest food? A:It always uses its noodle!\nRosey: Yum! Spaghetti! To “use your noodle” is to use your brain, that is, to think. Spaghetti is a type of noodle.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Did you hear about the actor who fell through the floor? A: Don’t worry, it was just a stage he was going through!\nRosey: Actors are the people who perform in a theater play or are on TV. The place where actors act is called the stage. So, if an actor falls through the floor he or she is falling through the stage.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What is an alien’s favorite candy? A: A Mars bar! Why is this joke funny?\nRosey: An alien is a being from outer space, perhaps like E.T. And you already know what candy is. You might not know what a Mars bar is, though. A Mars bar is a candy bar made by the Mars company. Yum! Mars is also the name of the 4th planet from the sun (we are on the 3rd planet, Earth!).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: How much did the butcher charge for his venison? A: A buck!\nRosey: There is so much going on in this joke! To begin with, a butcher is a person who prepares/ cuts meat so that it is ready to be cooked. Venison is meat that comes from a deer; a female deer is called a doe and a male deer is called a buck. A buck is also another name for one U.S. dollar ($1.00). This joke is funny because it plays on the double meaning of the work “buck.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Why couldn’t the monster go to sleep? A:It was afraid there were children under the bed! Why is this joke funny?\nRosey: This joke plays on a common fear of children that there is a monster under the bed- it turns that fear around by having the monster afraid that there are children under the bed.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:Why did the ninja go to the doctor? A:He had kung-flu!\nRosey: Kung-fu is a Chinese martial arts style of fighting. It is also the name of an old TV show, yes, Grasshopper. The flu (influenza) is a contagious respiratory illness caused by a virus. This joke plays on the similarity between “flu” and “fu.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:When does your dinner never get hot? A:When it is chili!\nRosey: Chili is a type of food (and the name of a restaurant). Chilly means cold. Chile is the name of a country. This joke plays on the words chili (the food) and chilly (not hot).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:Why is it hard to play cards in the jungle? A:Too many cheetahs!\nRosey: Cheetahs are large cats. The word “cheetah” sounds like the word “cheater,” a person who does not play by the rules; a person who cheats. It is really hard to play cards with a cheater!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What goes, “Oom, oom?” A:A backwards cow! Explain this joke.\nRosey: I'll try my best. Silly joke alert! In English, cows say, “Moo!” So if the cow is backwards is says, “Oom” which is “moo” written backwards. It is a good joke for a giggle!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What did Cinderella say when her photos did not show up? A: Someday my prints will come!\nRosey: The phrase would be, “Some day my prince will come.” Cinderella is waiting for her prince charming to sweep her off her feet. If she sent in some pictures to be developed she would wait for her prints to be printed, her pictures to be printed on paper.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What do you call cheese that is not yours? A:Nacho cheese! Explain this joke.\nRosey: I'll try my best. “Nacho cheese” sounds like “not your cheese” if you say it fast. And as far as I know, there is not really a cheese called “nacho cheese” but there is cheese that you put on tortilla chips to make nachos. Yum!!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: How did Ben Franklin feel about discovering electricity? A: He was shocked!\nRosey: First of all, Ben Franklin did not discover electricity (learn more about the electricity here). What he did was an experiment to prove that lightning was electrical. It is a good thing he wasn’t killed! Anyway, “to be shocked” is to be surprised. “Shocked” is also what you feel when a bit of electricity enters your body. This joke is funny because of the double meaning of the word shocked.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Knock knock! Who’s there?\nQueen\nQueen who?\nQueen yourself, I can smell you through the door.\nRosey: It is funny because it plays on the similar sounding words “queen” and “clean.” The listener expects something related to a queen knocking at the door. Instead, the listener hears an order to get “queen,” rather “clean.” It is as if the speaker does not speak clearly, like the cartoon character Elmer Fudd who is always outwitted by Bugs Bunny.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why can’t a nose be 12 inches long? A: If it was, then it would be a foot!\nRosey: In the standard system of measurement, the system that is used in the United States, 12 inches equals one foot (about 30 cm). A foot is also a body part, just as a nose is a body part. This joke plays on the double meaning of the word “foot.” And of course, a nose cannot be a foot!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Where do you find a birthday present for a cat? A: In a cat-alogue!\nRosey: A catalogue is magazine that shows things that someone can buy; you might see a clothing catalogue, an electronics catalogue, … You can see images from a 1945 Sears catalogue here. And from a 1980’s Sears catalogue here.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why couldn’t the 12 year-old go to the pirate movie? A: It was rated arrrrrgh!\nA: It was rated arrrrrgh!\nRosey: In the U. S. there is a system of rating movies:", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why didn’t the skeleton go to the ball? A: He had no body to dance with!\nRosey: “Ball” is a synonym for “dance.” So, why didn’t the skeleton go to the dance? Well, because a skeleton is all bones and nothing else, a skeleton does not have a body. That is, he has no body. When you put those two words together you get “nobody.” This joke is funny because it plays with the words “no body” and “nobody.” If he had nobody to go to the dance with he would go alone. In this case he had “no body.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the lady sing lullabies to her purse? A: She wanted a sleeping bag!\nRosey: Lullabies are the songs that caregivers sing to babies at bed time; the hope of singing a lullaby is that the child will fall asleep. The words “purse” and “bag” are synonyms; a purse is a shoulder bag that women use to carry their items. If the purse falls asleep, the bag would be sleeping. A “sleeping bag” is also the term used for a person-sized bag lined with warm materials that is used for sleeping, especially on camping trips. This joke plays on the phrase “sleeping bag” and the double meaning created in the joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: How does an Eskimo child fix his toys? A: With igloo!\nRosey: First of all, the term Eskimo is no longer used and is considered negative, pejorative, even racist. The two main groups who live in the northern regions by the arctic circle are the Yupik and Inuit. When naming groups of people let’s ask people what is the best name for them; people have the right to identify themselves.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What do you call someone who is afraid of picnics? A: A basket case!\nRosey: Picnics are relaxed, outdoor meals, often eaten on a blanket or a picnic table. When you go on a picnic you take a picnic basket– a basket that has the food and plates and everything you need for the picnic.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why can’t you take anything balloons say seriously? A: They’re always full of hot air!\nRosey: “To take something seriously” is to believe what someone is saying. “To be full of hot air” is to talk a lot without saying anything of importance or to say things that are not true. Balloons that rise into the air are literally full of hot air (or helium). This joke plays on the phrase “full of hot air.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why did Michael’s grades drop after the holidays? A: Because everything was marked down!\nRosey: The holidays refers to the time of the year between Thanksgiving and New Year’s Day. It is a time when lots of people by many gifts for various occasions (remember, these jokes mostly come from the United States and therefore reflect its humor and some of its customs). After the holidays stores have sales to get rid of merchandise that did not sell before the holidays; when an item is “on sale” the prices are “marked down.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What happened to the man who shoplifted a calendar on New Year’s Eve? A: He got 12 months! Explain this joke.\nRosey: I'll try my best. Shoplifters are people who steal from a store, usually something small (but shoplifters also steal larger items). Shoplifting is against the law so, if you are caught by the police, you might have to go to jail. If you are caught by the police you will have a trial and get sentenced to spend time in jail. In this case, “He got [sentenced to] 12 months” means that he will spend 12 months in jail. This joke is funny because a calendar also has 12 months, and that is what he got when he stole the calendar.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why are Christmas trees like bad knitters? A: They both drop their needles!\nRosey: Christmas trees that are brought into the house often lose their needles; they fall off the branches as the tree dries (even if it gets enough water). When someone knits a scarf or a sweater they use knitting needles, the long sticks that knitters use as they knit one and purl two. This joke is funny because it plays on the double meaning of the word “needles.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:How does Good King Wenceslas like his pizzas? A:Deep and crisp and even! Explain this joke.\nRosey: I'll try my best. “Good King Wenceslas looked out on the feast of Stephen. When the snow lay round about, deep and crisp and even.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:What do snowmen eat for breakfast? A:Frosted Flakes! Why is this joke funny?\nRosey: Frost is frozen water vapor on a surface; it is kind of in between ice and snow. Snowmen are made of snow, which is kind of like frost. Frosted Flakes are a common breakfast cereal. Can you imagine a snowman eating cereal? I like snowmen jokes at this time of year.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What does Tarzan sing on Christmas? A:Jungle Bells!\nRosey: “Jungle Bells” is an invented song name that reminds the listener of the song “Jingle Bells.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:How many presents can Santa fit in his empty sack? A:Only one. After that it is not empty anymore!\nRosey: The old empty sack trick! This joke plays on the understanding of the words “empty” and “how many.” The listener expects the answer to be a number, not an explanation. But it is true- if there is one gift in the sack it is no longer empty.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What did Mary Poppins want for Christmas? A: Supercalifragilisticexpialisnowshoes!\nRosey: Did you see the “snow shoes” part at the end of that word? This joke plays on the title of the song from Mary Poppins, Supercalifragilisticexpialidocious. You can watch a video of the song on the previous link. And there is a new movie about the making of Mary Poppins. Anyway, I think snow shoes would be a great gift.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:How much did Santa pay for his sleigh? A:Nothing. It was on the house! Why is this joke funny?\nRosey: If something is “on the house” it means it is free. Often you will hear the expression in a movie, “Drinks are on the house!” That means that the bartender or the owner of the restaurant will pay for the beverages. In this case the sleigh is literally on the house. That’s what makes the joke funny.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:What do you call an old snowman? A:Water!\nRosey: Snowmen do not last very long because eventually they melt. When a snowman melts he becomes water. This joke is funny because the listener is expecting a name, not water. You can watch the cartoon version of Frosty the Snowman here.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Who says, “Oh, oh, oh!”? A:Santa Claus walking backwards! Explain this joke.\nRosey: I'll try my best. Santa is known for saying, “Ho, ho ho!” as he laughs. If you write “ho, ho, ho” backwards you get “oh, oh, oh.” Silly, silly silly!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:What is a parent’s favorite Christmas carol? A:Silent Night.\nRosey: Christmas carols are the songs sung at Christmas time. Moms and dads enjoy a night that is quiet once in a while. Silent Night is the name of a Christmas carol and a silent night for parents means that the children are asleep. “All is calm.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q:What happened to the beans when they showed up late to work? A:They got canned!\nRosey: “To get canned” means to get fired, to lose your job. Beans, when they are not fresh, come in cans (or are frozen). Beans are canned when they are put into cans… but these beans were late to work so they got fired, they got canned! This joke is funny because it plays with the idea of getting canned.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the students eat their homework? A: Because the teacher said it was a piece of cake! Why is this joke funny?\nRosey: “It’s a piece of cake” means that something is really easy.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the computer say when it fell into the quicksand? A: “Help me! I’m syncing!” Why is this joke funny?\nRosey: When someone falls in quicksand they start to sink, that is, go down into the sand. When computers connect with other computers they “sync,” a word that means to synchronize. That is often how computers share information like when a person syncs an iPod with a computer to share music. The words sink and sync sound the same which is why this joke is funny.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why did the cookie go to the hospital? A: He was feeling really crumbie!\nRosey: Crumbs are the little pieces of cookie or bread that fall to the table as you eat; the “b” in the word crumb is silent so it sounds like “crum.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:What is a cat’s favorite color? A:Purr-ple\nRosey: Purple, that is! You see, the rumble noise that cats make under their chin when they are happy is called a purr. Cats meow and purr. This joke is funny because it plays on the “pur” part of purple. Rrrrrrrr!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: How do you keep someone in suspense? A: I’ll tell you tomorrow!\nRosey: Suspense is that feeling of wanting to know what is going to happen. In his films, Alfred Hitchcock was a master of suspense, keeping you on the edge of your seat waiting to find out what was going to happen next. That’s what makes this joke funny- the questioner keeps the listener in suspense by saying, “I’ll tell you tomorrow!”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What did the tooth fairy use to fix her wand? A: Toothpaste!\nRosey: The Tooth Fairy leaves small amounts of money under the pillow where small children have left a tooth that recently fell out. She always has a magic wand. I suppose that the wand could break and she would need some glue (also known as paste) to fix it. Because she is the Tooth Fairy she might use tooth-paste. That’s funny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Did you hear about the red ship and the blue ship that collided? A: All the sailors were marooned!\nRosey: Marooned: to be stranded on an island after a ship wreck. Maroon: a dark red, almost purple, color. So, when red and blue are mixed, you get purple, well, maroon. This joke plays with the knowledge that red and blue make maroon (almost, sort of maroonish purple) and the knowledge that a boat crash may leave sailors marooned.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:What did the sock say to the foot? A:“Shoe!”\nRosey: Or did the sock say, “Shoo!” “Shoo” means go away, scram, get out of here as in the song “Shoo Fly, Don’t Bother Me.” Shoe, obviously, is what you put on your foot (after you put on your sock). Was the sock pointing out that the shoe was coming closer?", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why was the nose feeling sad? A: It was tired of getting picked on! Explain this joke.\nRosey: I'll try my best. When you “pick your nose” you stick your finger in your nose and, well, remove whatever is in there. “To be picked on” means that someone is bothering you, bullying you: The older kid picked on the younger kid by pushing him every time they saw each other.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Why does Santa have a garden? A:So he can hoe, hoe, hoe! Why is this joke funny?\nRosey: When Santa laughs he says, “Ho, ho ho!” When you work in a garden sometimes you use a hoe (a tool with a long handle and a flat piece of metal on the end that is perpendicular to the long handle). This joke is funny because it changes “ho, ho, ho” for “hoe, hoe, hoe.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Where do polar bears vote? A: The North Poll!\nRosey: When you go to vote for a candidate, the place that you go is called the poll. Last year my polling place changed from a school to a nursing home; every year, though, I go to the poll to vote.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What did one elevator say to the other elevator? A: I think I’m coming down with something!\nRosey: There is a double meaning in this joke: “To come down with something” is to get sick; elevators come down with something- people. When the first elevator says it is coming down with something the listener hears the double meaning of getting sick and going to a lower floor — and that’s funny because elevators don’t get sick.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you reach a book in an emergency? A: Call its pager! Explain this joke.\nRosey: I'll try my best. A pager or a beeper is a small electronic device (not used much anymore because so many people have cell phones) that beeps or vibrates and shows the telephone number of the caller or a message from the caller. They are often used in hospitals or other locations where it is important to contact someone and do so with minimal interference.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What do you call four bullfighters in quicksand? A: Cuatro sinko!\nRosey: Ah, yes! A bad bilingual joke. Bullfighters are often found in Spanish speaking countries. The number four in Spanish is “cuatro.” If you are in quicksand you are probably sinking down into the sand.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did Tomás throw the clock out the window? A: He wanted to see time fly! Explain this joke.\nRosey: I'll try my best. “Time flies” means that time seems to pass quickly as in the expression, “time flies when you are having fun.” Of course if you throw a clock then the clock, which shows the time, is flying. This joke plays with the words “time flies,” both the figurative meaning and the literal meaning.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Knock, knock! Who’s There?\nTheodore.\nTheodore who?\nTheodore is stuck and it won’t open!\nRosey: Yesterday, teddy bears. Today, Theodore: thee-o door. The last part of the name “Theodore” sounds like “door.” If you say the whole name fast it can almost sound like “thee door” or “the door.” This joke is funny because it is not Theodore who is knocking at the door but someone who says the door is stuck.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why are teddy bears never hungry? A: They are always stuffed!\nRosey: After you finish eating you could say, “I am full” or you might say, “I’m stuffed.” Both expressions mean the same thing: you have eaten enough and you do not need to eat any more.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q:What did the baker say when he found his lost dough? A:“That’s just what I kneaded!”\nRosey: “To knead dough” is to push and pull it; that is what you do to the dough before you let it rise. “To knead” sounds just like “to need.” This joke plays on these phrases that sound the same. Do you knead more of an explanation? No, but you might need more of an explanation.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Did you hear the joke about the roof? A: Never mind, it’s over your head!\nRosey: “Over your head” can have two different meanings: 1) something is literally above you; 2) something is too hard for you to understand. For example: 1) the ceiling of the room I am in is over my head and keeps the snow off my shoulders; 2) Quantum physics is “over my head” because I do not understand it.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: When is a baby good at basketball? A: When it’s dribbling!\nRosey: “To dribble” the basketball means to bounce the ball as you walk or run down the basketball court. “To dribble” is also to let saliva drop from your mouth. Babies often dribble, that is, they drool, they let saliva or food or milk come out of their mouths.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why do scientists think humming birds hum? A: Because they can’t remember the words!\nRosey: “To hum” can be to sing, “la, la, la” when you don’t know the words to a song or keep your lips together and make the notes of a song. This joke is funny because hummingbirds don’t really hum; they chirp. They’re birds! I wonder why they can’t remember the words?", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the police arrest the turkey? A: They suspected it of foul play! Why is this joke funny?\nRosey: “Suspected of foul play” means that the police think you did something illegal. The group of birds that include chickens, duck, geese and turkeys are known as fowl. “Foul” and “fowl” sound the same. This joke plays with the word fowl/ foul and is really a lot funnier if spoken, not read. (A foul is also a mis-play in a sport such as basketball. Isn’t English fun!)", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Should you have your whole family for Thanksgiving dinner? A: No, you should just have the turkey!\nRosey: Another joke that plays with a double meaning. Imagine a conversation like this: “What did you have for dinner?” “I had soup and bread.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q:Which side of the turkey has the most feathers? A:The outside!\nRosey: At first when you hear this joke, the expectation is that the answer will be the right side or the left side, perhaps the top, bottom, front or back. What the listener does not expect is the outside; that answer is too obvious. That is why the joke is funny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What is the musical part of a turkey? A: The drumstick!\nRosey: “Drumstick” has two meanings: a drumstick is the piece of wood that a drummer uses to hit the drum and make music; a turkey leg, one that has been cooked and is ready to eat, is also called a drumstick. This joke plays on the double meaning of the word drumstick.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why did the bee get married? A: Because he found his honey!\nRosey: Sweetie, dear, my love, honey. These are all words/ phrases that a person might use for his or her significant other, for the love of your life. So, when you “find your honey” you find that person who means a lot to you. Then, you could marry that person.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the poor dog chase his own tail? A: He was trying to make ends meet!\nRosey: “To make ends meet” is an expression used when someone is working hard to earn enough money to pay the bills. The word “poor” in “poor dog” can be an expression of sympathy such as “you poor thing” or it can mean poor as in a person with little or no money.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: How did the music teacher get locked in the classroom? A: His keys were inside the piano!\nRosey: Well, the word “keys” in this joke has two meanings: 1) Keys are the white and black parts of the piano that your fingers touch when you play the piano; 2) Keys are the pieces of metal that you use to unlock doors. This joke is funny because piano keys are in the piano, they are part of the piano but if you leave the keys to your room in the piano then you cannot get into you room.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why are graveyards noisy? A: Because of all the coffin! Explain this joke.\nRosey: I'll try my best. A coffin is the box that dead people are buried in. Coughing is the body’s natural response when there is a tickle in the throat and you try to clear it- you cough.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you get from a pampered cow? A: Spoiled milk.\nRosey: To be “pampered” is to be taken care of in a very nice way. Someone might go to the spa to have her nails done and get a massage and we could say, “She is being pampered.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call newborn bee? A: A ba-bee! Why is this joke funny?\nRosey: Newborn is a word that refers to a baby who has recently come into the world, yes, a baby. A bee is an insect that gives us honey and pollinates plants.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do racers eat? A: Fast food! Why is this joke funny?\nRosey: A racer is a person who races, such as a runner or a race car driver. The whole point of a race is to go fast in order to win. “Fast food” is food that you can get at a restaurant like McDonalds: you order the food and they give it to you right away. So if you want to go fast you need to eat food that will give you the energy to go fast, or “fast food.” That’s what makes this joke funny! Of course fast food will not make you fast, fat perhaps, but not fast 🙂 .", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you get when you cross a bear and a ghost? A: Winnie the boo! Why is this joke funny?\nRosey: You already know what a bear is and you already know what a ghost is. But do you know about Winnie the Pooh? Winnie the Pooh is a stuffed bear created by A. A. Milne. Wonderful stories from a long time ago! “Pooh” sounds like “boo.” Ghosts say, “Boo!” Therefore we get Winnie the Boo!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What’s green and sings? A:Elvis Parsley!\nRosey: This joke is a play on words- “parsley”, a leafy green used as food, sounds a lot like “Presley” the last name of the famous singer, Elvis Presley. Parsley, Presley, Parsley, Presley, Parsley, Presley- try saying that 10 times fast.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you call a scared cow? A: A milk shake!\nRosey: When people get scared, frightened, they sometimes shake because of the fear they feel. A milkshake is a drink that mixes (or shakes) together ice cream and milk (sometimes with fruit or chocolate or …). So, if you shake a cow (which would be really hard to do!) you could get a milk-shake. Or if the cow gets scared it could shake itself and the milk that is inside it thereby making a milkshake. Crazy! It could never happen! That’s why it’s funny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: When does a teacher carry birdseed? A: When there is a parrot-teacher conference!\nRosey: Parrots like birdseed; they eat it! Teachers have conferences with parents called parent teacher conferences; it is a time to talk to the parents about how their children are doing in school. “Parrot-teacher” sounds like “parent-teacher” and that is what makes his joke funny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What letter is wet? A:The letter C !\nRosey: You see, the letter “c” sounds just like the word “sea” which is another word for the ocean. So, the “C” is wet. See!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why would a spider be a good baseball player? A: Because it is good at catching flies! Why is this joke funny?\nRosey: Spiders catch flies in their webs; flies (fly- singular) are small insects with wings. When spiders build spiderwebs the flies get stuck in them and the spiders eat them. When a baseball player hits a baseball and it goes up in the air to the outfield we say, “the baseball player has hit a fly ball,” that is, the player hit the ball and it flew through the air. The outfielders, the players standing far away from the batter, are waiting to catch the fly balls that have been hit. An outfielder who is good at this is good at catching flies… just like a spider.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Where do football players go before the big game? A: To the Toilet Bowl! Why is this joke funny?\nRosey: If someone says, “I gotta go!” that person means, “I have to go to the bathroom.” Imagine someone saying that while squeezing their legs together. Football championship games are called bowl games, think The Super Bowl, The Rose Bowl, … The part of a toilet where one leaves waste is the toilet bowl, the part you see filled with water. This joke is funny because it combines the ideas of going to the bathroom with a bowl game. 11 year olds might love this joke!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do elves learn in school? A: The elf-abet!\nRosey: One elf (singular), two elves (plural). Elves are mythological beings found in stories like The Hobbit or found at the north pole working for Santa Claus. The alphabet is learned by school children in all English speaking schools (and other languages too!). “Elf” sounds like “alf” or “alph,” the first part of the word alphabet. This joke is funny because it plays on the sounds in elf and alph.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What do you call a wet fruit? A: A watermelon!\nRosey: “Wet” is something that is liquid or has liquid on or in it. For example, a towel gets wet when you use it to soak up water; the street gets wet when it rains. Water is wet because it is a liquid. A watermelon isn’t really wet on the outside (unless it has been rained on or washed) but it does have lots of liquid on the inside. So a wet fruit, is a watermelon. Mmmm!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why do we put candles on top of a birthday cake? A: Because it’s too hard to put them on the bottom! Why is this joke funny?\nRosey: Well, this is funny because the listener is expecting a real explanation that has to do with adding candles to a cake, perhaps even explaining why we have cake for birthdays. But that is not the answer that the listener hears. The answer is just an obviously funny one! Candles on the bottom of a cake!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did John jump up and down before drinking his juice? A: The box said, “Shake well before drinking!” Explain this joke.\nRosey: I'll try my best. Johnny was sooooooo confused! When the box says, “Shake well before drinking” it is talking about the box, not the boy who is drinking the juice! Shake the box, Johnny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What kind of balls don’t bounce? A:Eye balls! Explain this joke.\nRosey: I'll try my best. Bounce is the way a ball goes up and down when thrown to the floor. Tennis balls bounce. Basketballs bounce. Eyeballs… don’t bounce. It would hurt too much if they did!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Who keeps the ocean clean? A:The mermaid!\nRosey: A mermaid is a mythological creature who is part woman, part fish. A “maid” is a person who cleans a house or a hotel. This joke plays on the meaning of the word “maid.” Does a mer-maid do windows?", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: How did the farmer mend his pants? A: With cabbage patches!\nRosey: To mend a pair of pants, such as jeans, is to fix them. If there is a hole in the knee you will need to patch the hole with a patch. Yes, “patch” can be used as a verb and a noun. “Patch” also means a small area of land that is planted with a the same type of vegetable such as cabbage: a cabbage patch. This joke plays on the multiple meanings of the word “patch.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why was the king only a foot tall? A: Because he was a ruler!\nRosey: A ruler is one who rules, that is, one who is in charge like a king or a president. A ruler is also a stick used for measuring items. In this case a ruler is 12 inches long, a foot long. This joke plays on the double meaning of the work ruler. This joke really measures up!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the lettuce win the race? A:He was a head!\nRosey: Lettuce is a green, leafy vegetable like in the picture. When you buy lettuce you buy “a head” of lettuce. The person who wins a race finishes first, that is, the person is ahead of the other. This joke plays on the difference between “ahead” and “a head.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the mommy rope say to the baby rope? A: “Don’t be knotty!” Why is this joke funny?\nRosey: When you tie a rope you make a knot. To behave badly is to be naughty (naw- tee); it is a word that is used with small children. “Knotty” sounds like “naughty” and “naughty” is a word that a mommy might use with her child, like in the joke! Be good; don’t be naughty!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What is a whale’s favorite game? A: Swallow the leader!\nRosey: Whales are known for eating lots and lots of fish and krill; that is, they swallow them. “Follow the Leader” is a well known children’s game where one personis the leader and the other children have to follow the leader, doing and going where the leader goes. This joke plays on the rhyming words follow and swallow.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: How is a baseball team similar to a pancake? A: They both need a good batter!\nRosey: The word “batter” can refer to the person on a baseball team who has the bat and is hitting the ball. The word “batter” can also mean the thick liquid that a cook uses to make pancakes. The batter is poured onto the griddle; the cooked batter is called a pancake. This joke plays on the double meaning of the word “batter.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What goes up and down but does not move? A: Stairs! Explain this joke.\nRosey: I'll try my best. You walk up the stairs and down the stairs. We say “the stairs go up to the next floor” or “the stairs go down to the basement.” That is, the stairs “go” but they do not move! Ha!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why do bicycles fall over? A: Because they are two-tired!\nRosey: Bicycles have two tires, that is, they have two wheels. If a car is four-tired (has 4 tires) then you could say a bike is two-tired (has two tires), although no one would actually say that- except in a joke. This joke plays on the words “too tired.” If you are very tired, too tired, you have no energy. Maybe you would fall over like the two-tired (too tired) bike!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What language does a billboard speak? A: Sign language!\nRosey: A billboard is one of those really big advertisements found along roads and on top of buildings; a billboard is a type of sign. This joke plays on the word “sign” which can mean a public, printed announcement that is usually large (like a street sign, a stop sign, a road sign, the name of a store on its facade, …) or it can be the first part of “sign language.” Sign language is a language used by hearing impaired people to communicate. So a billboard (a sign) speaks sign language because it is a sign!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What would we get if we threw all the books in the ocean? A: A title wave!\nRosey: A tidal wave is produced by the daily tides, which are caused by the gravitational pull of the moon and sun (officially, it is not a tsunami). Books have titles. The words “title wave” sound very much like “tidal wave.” Read all about it!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you call a sleeping bull? A: A bull-dozer.\nRosey: “To doze” is to sleep, but just for a little bit of time. A bulldozer is a machine that moves dirt. So, a sleeping bull is a bull that dozes or a bull-dozer which sounds like bulldozer!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How do you make a hot dog stand? A: Take away its chair! Why is this joke funny?\nRosey: You know what a hot dog is, right? A “hot dog stand” is a small place that sells hot dogs (see picture). This joke plays on the word stand which is also the opposite of sit. If you take away someone’s chair that person has to stand… just like the hot dog in this joke!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What do you call a fish with no eye? A: Fsh!\nRosey: When you hear this joke you are thinking about a fish with no eye, perhaps a blind fish. What makes this joke funny is that the answer is the sound “fsh” because there is no longer an “i” in the word fish. Ha!!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the girl spread peanut butter on the road? A: To go with the traffic jam!\nRosey: Peanut butter and jelly is a common type of sandwich in the United States. Jam and jelly are synonyms (they are not identical but very much the same). A traffic jam is when there are so many cars in one place that the cars are stopped (or moving very slowly). This joke plays with the word jam- the kind that goes with peanut butter and the kind that stops traffic. Ha ha ha!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you call cheese that isn’t yours? A: Nacho cheese! Explain this joke.\nRosey: I'll try my best. Nacho cheese is a form of processed cheese sauce mixed with peppers and other spices. It is used to make Nachos, a snack made with tortilla chips and there are many ways to make them. When you say “Nacho” it sounds like “not your.” So, if it’s “Nacho cheese,” that sounds like “not your cheese;” cheese which isn’t yours! Try some nachos; they’re great!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Where do generals keep their armies? A: In their sleevies!\nRosey: A general is the leader of an army (singular), so, generals are the leaders of armies (plural). When you put on a shirt your arm goes into the sleeve of the shirt. Often times in English, to make something small you put the “ee” sound on the end- cute becomes cutie, bird become birdie. In this joke arm becomes arm-ee so it goes into your sleeve-ee.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why did the invisible man turn down a job offer? A: He just couldn’t see himself doing it!\nRosey: The invisible man is a book by H. G. Wells and also a movie. If you are invisible no one can see you. This joke plays on the phrase, “I can’t see myself doing…” which means you can’t imagine doing something, such as taking a job. What is something you can’t see yourself doing?", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: Why did the computer keep sneezing? A: It had a virus!\nRosey: When someone is sick that person may sneeze. A virus is a really small thing, smaller than a cell in your body, that can make you sick. So, a virus can make you sneeze. A virus is also the name of a computer program that does something bad to your computer (or uses your computer in a way that you do not want it to). This joke is funny because it uses the word “virus” in two different ways. Wash your hands!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What do you get when you plant kisses? A: Two lips. Explain this joke.\nRosey: I'll try my best. You use your lips to kiss someone, that is, you use two lips: your upper lip (the one below your nose) and your lower lip (the one above your chin). The expression “plant a kiss” means to kiss someone deliberately. There is a flower called a tulip (sounds the same as two lip) which is typically planted in the fall and blooms in the spring. This joke plays on the sounds of “two lips” and “tulips.” Happy almost Valentine’s Day!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: What would you get if you crossed February 2 with a puppy?\nGround-dog Day! Why is this joke funny?\nRosey: All three of these jokes play with sounds: “roundhog” sounds like groundhog; “ground frog” sounds like groundhog; “ground- Dog” sounds like groundhog. And a puppy is a baby dog.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What’s a tornado’s favorite game? A: Twister!\nRosey: “Twister” is a synonym of tornado; they mean the same thing. Twister is also a game that has been around for a long time. This joke plays on the double meaning of the word Twister: another name for a tornado and a game. Click on the link to see people playing Twister.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: The turtle took two chocolates to Texas to teach Thomas to tie his boots. How many Ts in that? A: There are 2 Ts in “That“! Why is this joke funny?\nRosey: The question confuses the listener by having a sentence with so many of the letter “T”. While you are distracted trying to count Ts, the real question comes- How many Ts in “That”? Well, in the word “that” there are only 2 Ts: one at the beginning and one at the end. Got ya!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the music teacher need a ladder? A: To reach the high notes. Why is this joke funny?\nRosey: Ahh, yes! The high notes! When one goes up, like in an airplane or up a ladder, one is going up higher. The child cannot reach the cookies because they are up high. High notes are the ones more to the right on a piano; in science the larger the Hz the higher the note. But high notes are not up high; that’s why this joke is funny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q: What gets wetter the more it dries? A: A towel!\nRosey: A towel is used to dry something like a plate or your hands. As the towel dries your hands the towel, which was dry, becomes wet. It is not the towel that is becoming dry, it is your hands that are becoming dry. This joke is funny because it plays on the opposites of wet and dry. How could something get wet as it dries?", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Knock, knock! Who’s There?\nAsh.\nAsh who?\nBless you! Why is this joke funny?\nRosey: Ash who? Sounds like “Achoo!” “Achoo” is how the sound of a sneeze is written in English in the United States. So when the asker asks “Ash who?” it sounds like Achoo! And if someone sneezes you say “Bless you!”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why did Cinderella get kicked off the soccer team? A: Because she ran away from the ball!\nRosey: Cinderella went to that fancy dance party in her fancy dress. That fancy dance party is called “a ball.” So is the sphere that soccer players kick- a ball. This joke plays on the word “ball.” And soccer players can’t run away from the ball!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: What did the 0 say to the 8? A: Nice belt! Why is this joke funny?\nRosey: The number zero sees an eight and thinks it is just like me, a zero, so it must have a belt. Numbers thinking crazy thoughts!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: Why was 6 afraid of 7? A: Because 7, 8, 9!\nRosey: If you read the numbers is sounds like seven-eight (ate)-nine. And if I were 6, I, too, would be afraid of seven if it is eating other numbers, such as nine! Seven ate the nine!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: Why did the child study in the airplane? A: He wanted a higher education! Why is this joke funny?\nRosey: Higher education: that means studies beyond high school such as going to the university. Higher education does not refer to altitude, like studying while high in the sky; that’s why it’s funny.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q. What do you get when you cross a snowman with a vampire? A. Frostbite. Why is this joke funny?\nRosey: This is a common type of joke that is funny because you cross (combine) one thing with another (usually two things that do not go together). In this case a snowman (like Frosty the Snowman?) with a vampire (that bites people). Funny! Click this link to learn more about Frostbite. Frost is the ice that is formed on the ground when the temperature goes below freezing.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q. What did the grape do when it got stepped on? A. It let out a little wine!\nRosey: Wine is made from grapes. Traditionally (that is, a long time ago), grapes were “pressed” by stepping them ( did you see the scene in A Walk in the Clouds?) to get the juice out. “Whine,” which sounds the same as “wine,” means to complain a little bit about something. A child might whine about having to eat something he or she doesn’t like; you might whine if someone stepped on you, kind of like the grapes in the joke.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q. Why don’t skeletons fight each other? A. They don’t have the guts.\nRosey: To “have guts” is to be brave. If you “don’t have the guts” to do something it means you are scared to do it. “Guts” are your innards, your internal organs (heart, lung, liver, …). This joke plays on the idea that skeletons don’t have guts (they are nothing but bones so they have no internal organs), or are they scared. The double meaning of the word “guts” makes this joke funny.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Q: What did the water say to the boat? A: Nothing, it just waved.\nRosey: “Wave” is what you do when you move your hand as if saying hello. “Wave” is also the name for a way the top of the water moves: the raised part of the water that moves toward the shore is a wave. This joke plays on the word “wave” and is funny because the water waves (as if saying hello) while the water has waves (the raised part of the water).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Why is this joke funny? Q. Why do sea-gulls fly over the sea? A. Because if they flew over the bay they would be bagels!\nRosey: This joke plays on the words seagull (a bird) and bagel (a round bread shaped like a donut). There is no such thing as a bay gull but there is a bagel and both sound the same- that’s why it is funny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: What is black and white and red all over? A: A newspaper!\nRosey: This joke plays on the word red/ read. “Red” is a color, like black and white. “Read”(pronounced “red”) is the past tense of read (every day I read, yesterday I read). When your brain hears red after hearing black and white it assumes that the speaker is talking about colors. In this case the speaker is talking about the past tense verb read. A newspaper is black because of the ink and white because of the paper. It is read all over because you can read it anywhere in the world. Funny!", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Why was the broom late? A: It over swept!\nRosey: Brooms are for sweeping; one reason that people are late is because they over sleep. “Sleep” in the past tense is “slept” (everyday I sleep, yesterday I slept). “Slept” rhymes with swept (swept is sweep in the past tense- everyday I sweep, yesterday I swept). This joke is funny because the expected answer is “It over slept” not its rhyme, “It over swept.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q: How does a Snowman get to work? A: By icicle. Explain this joke.\nRosey: I'll try my best. Take a look at the answer- by icicle. If you say the two words quickly you get the word bicycle. An icicle is ice that is formed by dripping water, like ice that hangs off a roof in the winter. Again, here the funny part is playing with the words “by icicle” and “bicycle.”", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Explain this joke: Q: Where does a snowman keep his money? A: In a snow bank.\nRosey: This joke plays on the word “bank”. A bank is a place where people keep their money; a snowbank is a pile of snow (which is not a good place to keep money!).", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q.What runs around a soccer field but doesn’t move? A:A fence Explain this joke.\nRosey: I'll try my best. This joke plays on the word “runs”: A person runs; a fence runs around, that is, goes around, an area like a soccer field.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: I'm going to give you a joke. After I give you the joke, please explain it: Knock, knock.\nWho’s there?\nLettuce.\nLettuce who?\nLettuce in and you’ll find out!\nRosey: Knock-knock jokes play with words: words that sound the same but are different or words that have more than one meaning. In this joke the jokester is playing with the words “let us” and “lettuce.” It is funny because the listener assumes the word is lettuce.", "metadata": {"source": "unified_joke_explanations"}}
{"text": "<human>: Q:Why did the chicken cross the road? A:To get to the other side. Explain this joke.\nRosey: I'll try my best. The answer to this joke (“To get to the other side”) is so obvious, something everyone knows, that it is funny because it is silly, perhaps even stupid. Why else would you cross a road except to get to the other side?", "metadata": {"source": "unified_joke_explanations"}}
